ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f28p551x_pmbus_regs.xml
<module id="PMBUS_REGS" HW_revision="" description="PMBUS Registers">
	<register id="PMBCCR" width="32" page="1" offset="0x0" internal="0" description="PMBUS CONTROLLER Mode Control Register">
		<bitfield id="RW" description="RnW bit of the Message" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TARGET_ADDR" description="TARGET Address" begin="7" end="1" width="7" rwaccess="RW"/>
		<bitfield id="BYTE_COUNT" description="Number of Bytes Transmitted" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="CMD_ENA" description="CONTROLLER Command Code Enable" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="EXT_CMD" description="CONTROLLER Extended Command Code Enable" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="PEC_ENA" description="CONTROLLER PEC Processing Enable" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GRP_CMD" description="CONTROLLER Group Command Message Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="PRC_CALL" description="CONTROLLER Process Call Message Enable" begin="20" end="20" width="1" rwaccess="RW"/>
	</register>
	<register id="PMBTXBUF" width="32" page="1" offset="0x2" internal="0" description="PMBUS Transmit Buffer">
		<bitfield id="TXDATA" description="Transmit Message Data" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="PMBRXBUF" width="32" page="1" offset="0x4" internal="0" description="PMBUS Receive buffer">
		<bitfield id="RXDATA" description="PMBus Receive Data Register" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="PMBACK" width="32" page="1" offset="0x6" internal="0" description="PMBUS Acknowledge Register">
		<bitfield id="ACK" description="Allows firmware to ack/nack received data" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PMBSTS" width="32" page="1" offset="0x8" internal="0" description="PMBUS Status Register">
		<bitfield id="RD_BYTE_COUNT" description="Number of Data Bytes available in Receive Data Register" begin="2" end="0" width="3" rwaccess="R"/>
		<bitfield id="DATA_READY" description="Data Ready Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="DATA_REQUEST" description="Data Request Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EOM" description="End of Message Indicator" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="NACK" description="Not Acknowledge Flag Status" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="PEC_VALID" description="PEC Valid Indicator" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CLK_LOW_TIMEOUT" description="Clock Low Timeout Status" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="CLK_HIGH_DETECTED" description="Clock High Detection Status" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="TARGET_ADDR_READY" description="TARGET Address Ready" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="RPT_START" description="Repeated Start Flag" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="UNIT_BUSY" description="PMBus Busy Indicator" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="BUS_FREE" description="PMBus Free Indicator" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="LOST_ARB" description="Lost Arbitration Flag" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="CONTROLLER" description="CONTROLLER Indicator" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="ALERT_EDGE" description="Alert Edge Detection Status" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CONTROL_EDGE" description="Control Edge Detection Status" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="ALERT_RAW" description="Alert Pin Real Time Status" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CONTROL_RAW" description="Control Pin Real Time Status" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="SDA_RAW" description="PMBus Data Pin Real Time Status" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="SCL_RAW" description="PMBus Clock Pin Real Time Status" begin="21" end="21" width="1" rwaccess="R"/>
	</register>
	<register id="PMBINTM" width="32" page="1" offset="0xa" internal="0" description="PMBUS Interrupt Mask Register">
		<bitfield id="BUS_FREE" description="Bus Free Interrupt Mask" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="BUS_LOW_TIMEOUT" description="Clock Low Timeout Interrupt Mask" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DATA_READY" description="Data Ready Interrupt Mask" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DATA_REQUEST" description="Data Request Interrupt Mask" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TARGET_ADDR_READY" description="TARGET Address Ready Interrupt Mask" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EOM" description="End of Message Interrupt Mask" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ALERT" description="Alert Detection Interrupt Mask" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CONTROL" description="Control Detection Interrupt Mask" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LOST_ARB" description="Lost Arbitration Interrupt Mask" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CLK_HIGH_DETECT" description="Clock High Detection Interrupt Mask" begin="9" end="9" width="1" rwaccess="RW"/>
	</register>
	<register id="PMBTCR" width="32" page="1" offset="0xc" internal="0" description="PMBUS TARGET Mode Configuration Register">
		<bitfield id="TARGET_ADDR" description="Configures the current device address of the TARGET." begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="MAN_TARGET_ACK" description="Manual TARGET Address Acknowledgement Mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TARGET_MASK" description="TARGET address mask" begin="14" end="8" width="7" rwaccess="RW"/>
		<bitfield id="PEC_ENA" description="PEC Processing Enable" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="TX_COUNT" description="Number of valid bytes in Transmit Data Register" begin="18" end="16" width="3" rwaccess="RW"/>
		<bitfield id="TX_PEC" description="send a PEC byte at end of message" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="MAN_CMD" description="Manual Command Acknowledgement Mode" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="RX_BYTE_ACK_CNT" description="Number of data bytes to automatically acknowledge" begin="22" end="21" width="2" rwaccess="RW"/>
	</register>
	<register id="PMBHTA" width="32" page="1" offset="0xe" internal="0" description="PMBUS Hold TARGET Address Register">
		<bitfield id="TARGET_RW" description="Stored R/W bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="TARGET_ADDR" description="Stored device address" begin="7" end="1" width="7" rwaccess="R"/>
	</register>
	<register id="PMBCTRL" width="32" page="1" offset="0x10" internal="0" description="PMBUS Control Register">
		<bitfield id="RESET" description="PMBus Interface Synchronous Reset" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ALERT_EN" description="TARGET Alert Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="BUS_LO_INT_EDGE" description="Clock Low Timeout Interrupt Edge Select" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FAST_MODE" description="Fast Mode Enable" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FAST_MODE_PLUS" description="Fast Mode Plus Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CNTL_INT_EDGE" description="Control Interrupt Edge Select" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ALERT_MODE" description="Configures mode of Alert pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ALERT_VALUE" description="Configures output value of Alert pin in GPIO Mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ALERT_DIR" description="Configures direction of Alert pin in GPIO mode" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CNTL_MODE" description="Configures mode of Control pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CNTL_VALUE" description="Configures output value of Control pin in GPIO Mode" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CNTL_DIR" description="Configures direction of Control pin in GPIO mode" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SDA_MODE" description="Configures mode of PMBus Data pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SDA_VALUE" description="Configures output value of PMBus data pin in GPIO Mode" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SDA_DIR" description="Configures direction of PMBus data pin in GPIO mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CLK_LO_DIS" description="Clock Low Timeout Disable" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="TARGET_EN" description="PMBus TARGET Enable" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CONTROLLER_EN" description="PMBus CONTROLLER Enable" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CLKDIV" description="PMBUS Clock Divide Value" begin="27" end="23" width="5" rwaccess="RW"/>
		<bitfield id="ZH_EN" description="Zero data hold enable" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="I2CMODE" description="Bit to enable I2C mode" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="PMBTIMCTL" width="32" page="1" offset="0x12" internal="0" description="PMBUS Timing Control Register">
		<bitfield id="TIM_OVERRIDE" description="Overide the default settings of the timing parameters." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PMBTIMCLK" width="32" page="1" offset="0x14" internal="0" description="PMBUS Clock Timing Register">
		<bitfield id="CLK_HIGH_LIMIT" description="Determines the PMBUS CONTROLLER clock high pulse width." begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="CLK_FREQ" description="Determines the PMBUS CONTROLLER clock frequency." begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="PMBTIMSTSETUP" width="32" page="1" offset="0x16" internal="0" description="PMBUS Start Setup Time Register">
		<bitfield id="TSU_STA" description="Setup time, rise edge of CONTROLLER clock to start edge." begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="PMBTIMBIDLE" width="32" page="1" offset="0x18" internal="0" description="PMBUS Bus Idle Time Register">
		<bitfield id="BUSIDLE" description="Determines the Bus Idle Limit" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="PMBTIMLOWTIMOUT" width="32" page="1" offset="0x1a" internal="0" description="PMBUS Clock Low Timeout Value Register">
		<bitfield id="CLKLOWTIMOUT" description="Determines the clock low timeout value" begin="19" end="0" width="20" rwaccess="RW"/>
	</register>
	<register id="PMBTIMHIGHTIMOUT" width="32" page="1" offset="0x1c" internal="0" description="PMBUS Clock High Timeout Value Register">
		<bitfield id="CLKHIGHTIMOUT" description="Determines the clock high timeout value" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
</module>
